//---------------------------------------------------------------------------

#ifndef fly_modelH
#define fly_modelH
//---------------------------------------------------------------------------
// Компоненты Fly - Модели движения
//#include <FlyMMath.h>		// Математические функции
//////#include <FlySofa.h>		// Функции фундаментальной астрономии
//#include <FlySsp.h>		// Численные алгоритмы "пакета SSP"
//#include <FlyChebyshov.h>	// Апроксимация дискретной функции полиномами
				// Чебышёва
//#include <FlyCore.h>		// Собственоно сама модель движения
//#include <FlyCoreLink.h>	// Подключение всех необходимых библиотек
//#include <FlyMagicLNS.h>	// Метод узловых точек

//#include <FlyUrlLoader.h>	//
//#include <FlyUrlLoaderLink.h>	//

bool fly_model_pr; // Ведущий признак активности работы МД

#endif
