#include "SPSHead.h"
/*
  Модель СОТР

  Произвести расчет параметров СА и БО с точки зрения термодинамики.

  Параметры СТР:
         - температура воздуха в СА и БО в диапазоне 18..25 С ( при возможном
         понижении до 10 С и повышении до 30 С до 3 часов в сутки);
         - относительная влажность воздуха в жилых отсеках в диапазоне 20...80%
         (возможно повышение относительной влажности до 90% до 3 часов в сутки);
         - температура газа в приборном отсеке (ПО) и приборных зонах СА и БО
         в пределах 0...40 С;
         - температура баков, агрегатов и трубопроводов с компонентами топлива
         КДУ в АО и ПхО в пределах 0...30 С (без учета разогрева от работающих
         двигателей);
         - поле температур по корпусам отсеков не более 20 С для герметичных
         отсеков (но не ниже "точки росы") и не более 40 С для негермитичных
         отсеков.
         - скорость движения воздуха в жилой зоне - от 0.1 до 0.8 м/сек, в
         приборной зоне - от 0.05 до 1.5 м/сек.

         Свободный обьем жилых отсеков 6.5 м3

  СОГС обеспечивает:
         - поддержание парциального давления кислорода в диапазоне 140-310 мм рт.ст.
         при общем давлении 450-920 мм рт.ст. При этом объемное содержание
         кислорода допускается не более 40%;
         - содержание паров воды в атмосфере корабля в пределах 8-15 мм рт.ст.,
         углекислого газа не более 10 мм рт.ст.;

*/
             //  [ 0  1  2 ]
bool rrg_pr[3]; // 4  8  16
bool str_pr[3]; //OF MIN MAX
bool cond[2];   //BO  SA
bool vsa_pr,
     vent_vsk_pr,
     en_vsk_pr;
bool ksd_pr[3];
//int i;



void test_open_f (void){
//  if(i>=10){

 // } else {
 //  i++;
   //SPS_DataType.P_bo=SPS_DataType.P_bo-(SPS_DataType.P_bo*0.10);
 // }
}
