//----------------------------------------------------------------------------
// FlyUrlLoaderLink.h
// 
// Данный заголовок необходимо включить в прикладную программу, использующую
// компонент FlyUrlLoader, для автоматической линковки с библиотекой импорта
// FlyUrlLoader.lib.
// Данный файл включается только один раз, и желательно  в главный файл 
// поекта прикладной программы.
// 
// А. Николенко 03.05.2019
//----------------------------------------------------------------------------
#ifndef _FLY_URL_LOADER_LINK_H
#define _FLY_URL_LOADER_LINK_H

//----------------------------------------------------------------------------
#pragma message ("    Подключение библиотеки FlyUrlLoader...")
#pragma comment(lib, "FlyUrlLoader.lib")

//----------------------------------------------------------------------------
#endif // #ifndef _FLY_URL_LOADER_LINK_H