#pragma hdrstop
#include <vcl.h>
#include "arg_pks.h"
#include "main_header.h"
#include "argon/arg_header.h"
#include <DateUtils.hpp>
#pragma package(smart_init)
//---------------------------------------------------------------------------
//*/*/*/*/*/*/*/*/*/*/*/*/*/*/*//
//                             //
//     П Р О Г Р А М М А       //
//      К О Н Т Р О Л Я        //
//     С О С Т О Я Н И Й       //
//                             //
//*/*/*/*/*/*/*/*/*/*/*/*/*/*/*//

/////////////////////////////////
//   П О Д П Р О Г Р А М М А   //
// О Т П Р А В К И   Ч И С Л А //
//         В   И Р В И         //
//=============================//
//   Программа имитирует обмен //
//   между БЦВК и оператором   //
//   посредством ПРВИ. Данная  //
//   программа выводит сообще- //
//   ние на ИРВИ               //
/////////////////////////////////

void asti(AnsiString i[15]){

 }

//////////////////////////////////////////////////
//             П О Д П Р О Г Р А М М А          //
//               С Е Р В И С - С К Д            //
// №реж   3                                     //
// Подпрограмма запускается в момент ТСКД -:08: //
// Завякой на программу является 1 в cw_Zay[8]  //
// Программа посылает на ИРВИ строку,           //
// которой последовательно заполняются И.       //
// До Тскд - сервис показывает на ИРВИ величину //
// потребного импульса и время до СКД, а после  //
// показывает расчетное время до ГК и Vтек      //
//////////////////////////////////////////////////


void sskd (void) {
/* char fd[15];
fd[0] = ;
fd[1] = ;
fd[2] = ;
fd[3] = ;
fd[4] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;
fd[0] = ;  */


}