//--------------------------------------------------------------------------------
//
//
//--------------------------------------------------------------------------------
#ifndef ATM440181_H
#define ATM440181_H

#include <FlyCoreSource\\ZMForceAtmSMA.h>

//--------------------------------------------------------------------------------
class ZMAtmSMA440181 : public ZMAtmSMA {
public :
	//----------------------------------------------------------------------------
	ZMAtmSMA440181() {};
	~ZMAtmSMA440181() {};

	virtual int Calc(double* xg, double& ro) ;

	//высота _геометрическая_ [м], *a[3]{ p, ro , T}
	int CalcPROT(double* xg, double *a) ;
	//высота _геометрическая_ [м]
	double ro(double h) ;
	//давление [кг/кмоль] высота _геометрическая_ [м]
	double P(double h) ;
	//молярная масса [кг/кмоль] высота _геометрическая_ [м]
	double M(double h) ;
	//температура[К], высота _геометрическая_ [м]
	double T(double h, bool needMolTemp) ;
	//концентрация частиц воздуха [штуки], высота _геометрическая_ [м]
	double N(double h) ;
	//скорость звука местная[м/с^2], высота _геометрическая_ [м]
	double a(double h) ;
	//---------------------------------------------------------------------------
protected:
	//---------------------------------------------------------------------------
	//строим профиль давлений
	//void   buildProf() ;
	void   formerH(double Hh, bool fromGeometric, double& H, double& h) ;
	//сам профиль
	double p[12] ;
	double p1[10] ;
	//---------------------------------------------------------------------------
} ;

//--------------------------------------------------------------------------------
#endif ATM440181_H
