//---------------------------------------------------------------------------
// ZMForceAtmDMA2001_Gost25645000.h
// Вычисление плотности динамической атмосферы по 
// ГОСТ Р 25645.000-2001.
// А. Николенко 06.11.2018.
//---------------------------------------------------------------------------
#ifndef ZMForceAtmDMA2001_Gost25645000_H
#define ZMForceAtmDMA2001_Gost25645000_H

#include <FlyCoreSource\\ZMForceAtmDMAISA.h>

//--------------------------------------------------------------------------------
//	JD         - Юлианская дата, соответствующая текущему времени, UTC
//	ISA        - Индексы солнечной активности
//	SUNg       - Координаты Солнца в гринвичской вращающейся СК, [км]
//	XYZg       - Координаты КА в гринвичской вращающейся СК, [км]
//	ro         - Искомая плотность атмосферы в кг/м3
//--------------------------------------------------------------------------------
int DMA_GOST_25645_000_2001(double JD, ISA_DMA ISA, double* SUNg, double* XYZg, double& ro) ;

//---------------------------------------------------------------------------
#endif //#ifndef ZMForceAtmDMA2001_Gost25645000_H
