//-------------------------------------------------------------------------------
// BuildLotsOfKLT.h : 
// А. Николенко 15.01.2019
//-------------------------------------------------------------------------------
#ifndef BUILD_LOTSOF_KLT_H
#define BUILD_LOTSOF_KLT_H

struct KLTOrb {
	int    K ;
	int    L ;
	double T ;
};

inline bool operator > (KLTOrb& K1, KLTOrb& K2) { return(K1.T>K2.T) ; }
inline bool operator < (KLTOrb& K1, KLTOrb& K2) { return(K1.T<K2.T) ; }

typedef vector<KLTOrb> VKLTOrb ;

//-------------------------------------------------------------------------------
// Построение множества возможных суточных кратностей (VKL)
//
// maxD = 1.0/14.0	Максимальное значение рационального числа
// minD = 1.0/16.0	Минимальное значение рационального числа
// K0 = 1			Начальное (минимальное) значение числителя
// KM = 14			Максимальное значение числителя
// L0 = 14			Начальное (минимальное) значение знаменателя
// LM = 224			Максимальное значение знаменателя
//-------------------------------------------------------------------------------
FLYORBITDESIGN_API void BuildLotsOfKLT(double minD, double maxD, int K0, int KM, int L0, int LM, VKLTOrb& VKL);

//-------------------------------------------------------------------------------
#endif // #ifndef BUILD_LOTSOF_KLT_H
